{
  "basic_interpretations": {
    "sun": {
      "양자리": "양자리 태양은 열정적이고 활동적인 성격을 가지고 있습니다. 용기 있고 자신감 넘치는 에너지를 가지고 있으며, 도전을 두려워하지 않습니다. 독립적이고 자율적인 성격으로, 자신만의 길을 개척하는 것을 좋아합니다. 직설적이고 솔직한 표현 방식을 가지고 있어 생각한 것을 바로 말하는 경향이 있습니다. 선구자적인 기질이 있어 새로운 시도를 주저하지 않습니다.",
      "황소자리": "황소자리 태양은 안정적이고 실용적인 성격을 가지고 있습니다. 지구력과 인내심이 뛰어나며, 한번 시작한 일은 끝까지 해내는 성향이 있습니다. 물질적 안정과 편안함을 중요시하며, 미적 감각이 뛰어납니다. 변화보다는 안정을 선호하며, 신중하고 신뢰할 수 있는 성격입니다. 전통과 가치를 중요시하고, 실질적인 결과를 추구합니다.",
      "쌍둥이자리": "쌍둥이자리 태양은 지적이고 적응력이 뛰어난 성격을 가지고 있습니다. 뛰어난 의사소통 능력과 표현력을 가지고 있으며, 다양한 주제에 관심을 보입니다. 호기심이 왕성하고 새로운 지식과 경험을 끊임없이 추구합니다. 빠른 이해력과 적응력을 가지고 있어 변화하는 환경에 잘 대처합니다. 다재다능하고 여러 가지 일을 동시에 처리하는 능력이 있습니다.",
      "게자리": "게자리 태양은 감성적이고 보호적인 성격을 가지고 있습니다. 깊은 감성과 직관력을 가지고 있으며, 타인의 감정에 민감합니다. 가족과 가정을 중요시하며, 소중한 사람들을 보호하고 돌보는 본능이 강합니다. 안전과 안정을 추구하며, 익숙한 환경과 관계에서 편안함을 느낍니다. 기억력이 좋고 과거와의 연결을 중요시하며, 전통과 역사에 관심이 있을 수 있습니다.",
      "사자자리": "사자자리 태양은 카리스마 있고 창의적인 성격을 가지고 있습니다. 자신감이 넘치고 자신의 존재감을 당당하게 표현합니다. 창의적이고 예술적인 재능과 표현력이 뛰어납니다. 관대하고 따뜻한 마음을 가지고 있으며 충성심이 강합니다. 리더십이 있고 주목받기를 좋아합니다. 열정적이고 활기차며 긍정적인 에너지를 발산합니다.",
      "처녀자리": "처녀자리 태양은 실용적이고 완벽주의적인 성격을 가지고 있습니다. 세심하고 분석적인 성향으로 세부사항에 주의를 기울입니다. 체계적이고 조직적인 접근 방식을 선호하며, 효율성을 추구합니다. 봉사정신이 강하고 타인을 돕는 것을 좋아합니다. 실용적인 해결책을 찾는 능력이 뛰어나며, 건강과 웰빙에 관심이 많습니다.",
      "천칭자리": "천칭자리 태양은 균형과 조화를 추구하는 성격을 가지고 있습니다. 공정함과 균형을 중요시하며 모든 관점을 고려합니다. 사교적이고 대인관계에 능숙하며 협력을 좋아합니다. 미적 감각이 뛰어나고 아름다움과 조화를 추구합니다. 갈등을 피하고 평화로운 해결책을 찾으려 노력합니다. 다양한 의견을 듣고 중재하는 능력이 뛰어납니다.",
      "전갈자리": "전갈자리 태양은 강렬하고 깊이 있는 성격을 가지고 있습니다. 깊은 통찰력과 직관력을 가지고 있으며, 표면적인 것보다 본질을 추구합니다. 강한 의지력과 결단력을 가지고 있어 목표를 향해 끈기 있게 나아갑니다. 비밀과 신비로운 것에 대한 호기심이 강하며, 숨겨진 진실을 발견하는 능력이 뛰어납니다. 감정이 깊고 열정적이며, 한번 관계를 맺으면 매우 충성스럽고 헌신적입니다.",
      "궁수자리": "궁수자리 태양은 자유롭고 모험적인 성격을 가지고 있습니다. 낙관적이고 열정적인 에너지를 가지고 있으며, 새로운 경험을 추구합니다. 철학적이고 지혜를 추구하는 성향이 있으며, 더 큰 의미와 진리를 찾고자 합니다. 직설적이고 솔직한 표현을 선호하며, 자유로운 사고를 중요시합니다. 여행과 학습을 통해 시야를 넓히는 것을 좋아합니다.",
      "염소자리": "염소자리 태양은 책임감 있고 야심적인 성격을 가지고 있습니다. 목표 지향적이며 장기적인 계획을 세우고 실행하는 능력이 뛰어납니다. 인내심과 지구력이 강하며, 어려운 상황에서도 포기하지 않습니다. 전통과 질서를 중요시하며, 안정적인 기반을 구축하려고 노력합니다. 성취와 인정을 중요시하며, 사회적 지위와 성공을 추구합니다.",
      "물병자리": "물병자리 태양은 독립적이고 혁신적인 성격을 가지고 있습니다. 독창적이고 창의적인 사고방식을 가지고 있으며, 새로운 아이디어와 관점을 추구합니다. 사회적 의식이 강하고 더 큰 공동체와 인류의 이익에 관심을 가집니다. 관습에 얽매이지 않는 자유로운 정신을 가지고 있어 기존의 규칙과 전통에 도전할 수 있습니다. 개인의 독특함을 중요시하며, 다양성과 평등을 추구합니다.",
      "물고기자리": "물고기자리 태양은 직관적이고 감성적인 성격을 가지고 있습니다. 매우 직관적이고 공감 능력이 뛰어납니다. 예술적 감각과 풍부한 상상력을 가지고 있습니다. 다른 사람들의 감정을 쉽게 느끼고 이해합니다. 영적이거나 신비적인 주제에 끌리는 경향이 있습니다. 이상주의적이고 낭만적인 성향을 가지고 있으며, 때로는 현실과 환상의 경계가 모호할 수 있습니다."
    },
    "moon": {
      "양자리": "양자리 달은 직설적이고 솔직한 감정 표현을 가지고 있습니다. 감정적으로 독립적이고 자율적이며, 즉각적인 감정 표현을 선호합니다. 내면적으로 강한 의지와 결단력을 가지고 있어 감정적 도전에 적극적으로 대응합니다. 새로운 감정적 경험에 열려 있고, 모험을 통해 내면적 성장을 추구합니다. 감정이 빠르게 일어나고 표현되지만 오래 지속되지 않는 경향이 있습니다.",
      "황소자리": "황소자리 달은 감정적으로 안정감과 보안을 중요시합니다. 편안함과 물질적 안전을 추구하며, 감각적인 즐거움과 아름다움을 중요시합니다. 변화보다는 안정을 선호하며, 신뢰할 수 있는 관계와 환경에서 정서적 안정을 느낍니다. 감정을 천천히 표현하지만, 한번 감정이 생기면 깊고 강하게 유지됩니다. 내면적으로 강한 인내심과 결단력을 가지고 있어 한번 결정한 일은 꾸준히 진행합니다.",
      "쌍둥이자리": "쌍둥이자리 달은 감정을 지적으로 분석하고 표현하는 경향이 있습니다. 다양한 감정적 경험을 추구하며, 의사소통을 통해 감정을 처리합니다. 호기심이 많고 새로운 감정적 자극을 원하며, 변화하는 감정 상태를 자연스럽게 받아들입니다. 감정을 말로 표현하는 것을 선호하며, 지적인 교류를 통해 감정적 만족을 얻습니다. 때로는 감정의 깊이보다 다양성을 추구할 수 있습니다.",
      "게자리": "게자리 달은 감정적으로 매우 민감하고 직관적입니다. 가족과 가정에 대한 강한 애착을 가지고 있으며, 익숙한 환경에서 감정적 안정을 찾습니다. 타인의 감정에 쉽게 공감하고, 보호적이고 양육적인 본능이 강합니다. 과거의 기억과 경험이 현재의 감정에 큰 영향을 미치며, 전통과 가족 가치를 중요시합니다. 감정의 변화가 크고, 달의 주기와 같이 감정이 변화할 수 있습니다.",
      "사자자리": "사자자리 달은 감정적으로 따뜻하고 열정적입니다. 내면적으로 인정받고 존경받기를 원하는 욕구가 강합니다. 창의적인 자기표현과 성취를 통해 감정적 만족을 얻는 경향이 있습니다. 사랑하는 사람들에게 매우 관대하고 보호적이며, 충성심이 강합니다. 때로는 감정적으로 드라마틱할 수 있으며, 자존심이 상하면 크게 반응할 수 있습니다. 감정 표현이 풍부하고 활기찹니다.",
      "처녀자리": "처녀자리 달은 감정을 분석적으로 처리하는 경향이 있습니다. 내적으로 질서와 체계를 추구하며, 실용적인 방식으로 감정적 안정을 찾습니다. 세부사항에 주의를 기울이고 완벽함을 추구합니다. 자기 개선과 성장에 대한 내면적 욕구가 있으며, 건강과 웰빙에 관심이 많습니다. 때로는 자기 비판적이고 걱정이 많을 수 있으며, 감정을 너무 분석적으로 접근할 수 있습니다.",
      "천칭자리": "천칭자리 달은 감정적으로 균형과 조화를 추구합니다. 관계 속에서 감정적 안정을 찾으며, 파트너십과 협력을 통해 내면의 만족감을 얻습니다. 미적 감각이 뛰어나고 아름다움에 감정적으로 반응하는 경향이 있습니다. 공정함과 정의를 중요시하며, 모든 관점을 고려하려는 내면적 욕구가 있습니다. 때로는 결정을 내리는 것에 어려움을 느끼며, 감정적인 균형을 찾기 위해 노력합니다.",
      "전갈자리": "전갈자리 달은 감정이 깊고 강렬합니다. 표면적인 것보다 깊은 감정적 연결을 추구하며, 내면적으로 강한 직관력과 통찰력을 가지고 있어 다른 사람의 숨겨진 감정을 잘 파악합니다. 감정을 쉽게 드러내지 않고 신뢰할 수 있는 사람에게만 내면을 열어 보이는 경향이 있습니다. 극단적인 감정을 경험할 수 있으며, 감정적 깊이와 강도가 큽니다. 변화와 재생에 대한 내면적 이해가 있습니다.",
      "궁수자리": "궁수자리 달은 내면적으로 자유와 모험을 갈망합니다. 넓은 시야와 새로운 경험을 통해 감정적 만족을 얻습니다. 낙관적이고 열정적인 감정 표현을 가지고 있으며, 솔직하고 직설적인 방식으로 감정을 표현합니다. 철학적인 지혜와 더 큰 진리를 추구하는 내면의 여정이 있습니다. 감정적으로 자유로움을 중요시하며, 구속받는 것을 싫어합니다. 유머 감각이 풍부하고 내면에 어린아이 같은 열정과 호기심이 있습니다.",
      "염소자리": "염소자리 달은 감정적으로 절제되어 있고 자기 통제력이 강합니다. 내면적으로 책임감과 의무감을 중요시하며, 감정보다 실용성을 우선시하는 경향이 있습니다. 감정적 안정을 위해 성취와 안전을 추구하며, 목표를 향해 꾸준히 노력합니다. 내면에 야망이 있고 자신의 감정에 대해 실용적인 접근을 합니다. 어려운 상황에서도 감정적 회복력이 강하며, 자기 훈련과 인내를 통해 감정을 다스립니다.",
      "물병자리": "물병자리 달은 감정적으로 독립적이고 객관적입니다. 개인의 감정보다 더 큰 이상과 인도주의적 가치를 중요시합니다. 감정을 지적으로 분석하는 경향이 있으며, 독특하고 창의적인 방식으로 감정을 표현합니다. 자유로운 감정 표현을 선호하며, 관습적인 감정 패턴에 얽매이지 않습니다. 때로는 감정적 거리를 두려는 경향이 있으며, 집단의식과 사회적 연대감에서 감정적 만족을 찾습니다.",
      "물고기자리": "물고기자리 달은 감정적으로 매우 직관적이고 공감 능력이 뛰어납니다. 내면적으로 풍부한 상상력과 예술적 감각을 가지고 있습니다. 다른 사람들의 감정을 쉽게 흡수하고 이해하는 경향이 있습니다. 경계가 유연하여 때로는 자신과 타인의 감정을 구분하기 어려울 수 있습니다. 이상주의적이고 낭만적인 내면 세계를 가지고 있으며, 영적인 주제에 관심이 있을 수 있습니다. 감정이 변화무쌍하고 깊은 감수성을 가지고 있습니다."
    },
    "ascendant": {
      "양자리": "양자리 어센던트는 활동적이고 적극적인 첫인상을 줍니다. 자신감 있고 에너지 넘치는 모습으로 사람들에게 다가가는 경향이 있습니다. 직설적이고 솔직한 태도로 세상을 대하며, 도전을 두려워하지 않는 모습을 보여줍니다. 리더십이 있어 보이며, 새로운 시작을 좋아하는 이미지를 줍니다. 빠른 결정과 행동력이 외적으로 드러나며, 독립적인 성격이 느껴집니다.",
      "황소자리": "황소자리 어센던트는 차분하고 안정적인 첫인상을 줍니다. 신뢰할 수 있고 믿음직한 이미지를 발산하며, 실용적이고 현실적인 접근 방식을 보여줍니다. 인내심이 있어 보이고, 꾸준하고 지속적인 노력을 하는 사람으로 인식됩니다. 미적 감각이 뛰어나 보이며, 품질과 가치를 중요시하는 모습을 보입니다. 편안함과 안정감을 추구하는 태도가 외적으로 드러납니다.",
      "쌍둥이자리": "쌍둥이자리 어센던트는 지적이고 호기심 많아 보이며, 활발하고 밝은 에너지를 발산합니다. 소통 능력이 뛰어나 보이고, 다양한 주제에 대해 대화를 이끌어가는 모습을 보여줍니다. 적응력이 높고 유연한 태도로 사람들에게 다가가는 경향이 있습니다. 빠른 사고와 재치 있는 말솜씨로 첫인상에서 지적인 매력을 보여줍니다. 다재다능하고 여러 일을 동시에 처리할 수 있는 능력이 있어 보입니다.",
      "게자리": "게자리 어센던트는 따뜻하고 친근한 첫인상을 줍니다. 보호적이고 양육적인 에너지를 발산하며, 다른 사람들을 편안하게 만드는 능력이 있어 보입니다. 감정적으로 민감하고 공감 능력이 뛰어나 보이며, 가족적이고 친밀한 관계를 중시하는 모습을 보여줍니다. 직관적이고 감성적인 접근 방식을 가지고 있어 보이며, 전통과 과거를 소중히 여기는 태도가 느껴집니다.",
      "사자자리": "사자자리 어센던트는 자신감 있고 카리스마 있는 첫인상을 줍니다. 존재감이 강하게 느껴지며, 따뜻하고 열정적인 에너지로 사람들에게 다가가는 경향이 있습니다. 창의적이고 표현력이 풍부하며, 자신만의 스타일과 독특함을 드러냅니다. 리더십이 있어 보이며, 자연스럽게 상황의 중심이 되는 경우가 많습니다. 관대하고 긍정적인 태도로 주변 사람들에게 영감을 줍니다.",
      "처녀자리": "처녀자리 어센던트는 차분하고 분석적이며 정돈된 이미지를 줍니다. 세심하고 신중한 태도로 사람들에게 다가가며, 실용적인 접근 방식을 보여줍니다. 지적이고 논리적인 면모가 외적으로 드러나며, 문제 해결 능력이 뛰어나 보입니다. 겸손하고 정확성을 추구하는 모습으로 신뢰감을 줍니다. 세부사항에 주의를 기울이는 완벽주의적 성향이 외부에 표현됩니다.",
      "천칭자리": "천칭자리 어센던트는 우아하고 균형 잡힌 첫인상을 줍니다. 매력적이고 세련된 이미지를 발산하며, 외교적이고 조화를 추구하는 태도로 사람들에게 다가가는 경향이 있습니다. 공정함과 균형을 중요시하며, 갈등보다는 협력을 선호하는 모습을 보여줍니다. 예술적인 감각과 미적 안목이 뛰어나 보이며, 세련된 취향이 느껴집니다. 사회적 관계에서 매끄러운 소통 능력을 보여줍니다.",
      "전갈자리": "전갈자리 어센던트는 강렬하고 신비로운 첫인상을 줍니다. 깊이 있고 통찰력 있어 보이며, 표면적인 것보다 본질을 추구하는 모습을 보여줍니다. 카리스마가 있고 자기 확신이 느껴지며, 다른 사람들의 동기와 숨겨진 면을 잘 파악하는 것처럼 보입니다. 변화와 변환에 대한 이해가 깊어 보이며, 위기 상황에서 강한 면모를 드러냅니다. 비밀스럽고 선택적인 소통 방식을 가지고 있어 보입니다.",
      "궁수자리": "궁수자리 어센던트는 자유롭고 낙관적인 첫인상을 줍니다. 모험적이고 열정적인 에너지를 발산하며, 개방적이고 솔직한 태도로 사람들에게 다가갑니다. 철학적이고 지혜로워 보이며, 더 큰 의미와 진리를 추구하는 모습을 보여줍니다. 여행과 새로운 경험을 좋아하는 것처럼 보이며, 국제적이고 다문화적인 관심을 가진 것으로 인식됩니다. 유머 감각이 있고 긍정적인 에너지를 전달합니다.",
      "염소자리": "염소자리 어센던트는 진중하고 책임감 있는 첫인상을 줍니다. 신뢰할 수 있고 안정적인 이미지를 발산하며, 목표 지향적이고 야심적인 모습을 보여줍니다. 전문적이고 성숙한 태도로 사람들에게 다가가며, 장기적인 계획과 지속적인 노력을 중시하는 것처럼 보입니다. 전통과 질서를 존중하는 모습이 느껴지며, 사회적 지위와 성취를 중요시하는 태도가 드러납니다.",
      "물병자리": "물병자리 어센던트는 독특하고 개성적인 첫인상을 줍니다. 독립적이고 자유로운 정신을 가진 것처럼 보이며, 혁신적이고 창의적인 아이디어를 가진 사람으로 인식됩니다. 인도주의적이고 사회적 의식이 강해 보이며, 다양성과 평등을 중시하는 모습을 보여줍니다. 관습에 얽매이지 않는 자유로운 접근 방식을 가지고 있어 보이며, 미래 지향적인 사고를 가진 것으로 보입니다.",
      "물고기자리": "물고기자리 어센던트는 부드럽고 꿈꾸는 듯한 첫인상을 줍니다. 따뜻하고 친절한 에너지를 발산하며, 공감 능력이 강하게 느껴집니다. 다른 사람들의 감정에 민감하게 반응하며, 창의적이고 예술적인"
    }
  },
  "gender_specific": {
    "male": {
      "sun": {
        "양자리": "남성으로서 양자리 태양은 강한 리더십과 주도성을 나타냅니다. 경쟁적인 환경에서 뛰어난 능력을 발휘하며, 개척자 정신이 강합니다. 직업적으로는 독립적인 사업이나 새로운 프로젝트를 이끄는 역할에 적합합니다. 관계에서는 주도권을 가지려 하며, 파트너의 독립성도 존중하는 경향이 있습니다.",
        "황소자리": "남성으로서 황소자리 태양은 안정적인 토대를 구축하는 능력이 뛰어납니다. 가족과 파트너에게 물질적, 정서적 안정을 제공하는 것을 중요시합니다. 인내심이 강하고 꾸준한 노력으로 성과를 이루어내는 특성이 있습니다. 품질과 가치를 중시하며, 장기적인 투자와 계획을 선호합니다.",
        "쌍둥이자리": "남성으로서 쌍둥이자리 태양은 뛰어난 의사소통 능력과 네트워킹 스킬을 가지고 있습니다. 다양한 분야에 관심을 가지며, 정보를 수집하고 전달하는 능력이 탁월합니다. 유연한 사고방식으로 변화하는 환경에 잘 적응하며, 창의적인 아이디어를 실현하는 능력이 있습니다.",
        "게자리": "남성으로서 게자리 태양은 가정과 가족을 매우 중요시합니다. 보호본능이 강하고 책임감이 있으며, 사랑하는 사람들을 위해 헌신하는 특성이 있습니다. 직관력이 뛰어나고 감정적 지능이 높아 타인의 필요를 잘 파악합니다. 전통적인 가치를 존중하면서도 현대적인 감각을 조화롭게 결합합니다.",
        "사자자리": "남성으로서 사자자리 태양은 자연스러운 리더십과 카리스마를 가지고 있습니다. 창의적인 표현력이 뛰어나고, 주목받는 것을 즐기며 다른 사람들에게 영감을 줍니다. 관대하고 충성스러운 성격으로 사람들의 존경을 받으며, 자신감 있는 모습으로 목표를 달성해 나갑니다.",
        "처녀자리": "남성으로서 처녀자리 태양은 세심함과 완벽주의적 성향을 가지고 있습니다. 분석적이고 논리적인 사고로 문제를 해결하는 능력이 뛰어나며, 디테일에 강한 집중력을 보입니다. 봉사정신이 강하고 실용적인 해결책을 제시하는 능력이 있어 신뢰받는 조언자 역할을 합니다.",
        "천칭자리": "남성으로서 천칭자리 태양은 뛰어난 외교술과 중재 능력을 가지고 있습니다. 공정함과 균형을 추구하며, 다양한 관점을 고려하여 최선의 결정을 내리려 노력합니다. 미적 감각이 뛰어나고 사교적이며, 조화로운 관계를 만들어가는 재능이 있습니다.",
        "전갈자리": "남성으로서 전갈자리 태양은 강한 의지력과 집중력을 가지고 있습니다. 깊이 있는 통찰력으로 본질을 파악하는 능력이 뛰어나며, 위기 상황에서 냉정함을 유지하는 특성이 있습니다. 충성심이 강하고 신뢰할 수 있는 파트너가 되며, 변화와 혁신을 이끌어내는 힘이 있습니다.",
        "궁수자리": "남성으로서 궁수자리 태양은 모험정신과 철학적 사고를 가지고 있습니다. 자유를 추구하며 새로운 경험과 학습에 열려있고, 비전을 제시하고 영감을 주는 능력이 있습니다. 낙관적이고 직설적인 성격으로 진정성 있는 관계를 추구합니다.",
        "염소자리": "남성으로서 염소자리 태양은 강한 책임감과 야심을 가지고 있습니다. 장기적인 목표를 설정하고 체계적으로 달성해 나가는 능력이 뛰어나며, 사회적 성취와 인정을 중요시합니다. 전통적인 가치를 존중하면서도 실용적인 혁신을 추구합니다.",
        "물병자리": "남성으로서 물병자리 태양은 독립적이고 혁신적인 사고를 가지고 있습니다. 사회적 의식이 강하고 인도주의적 가치를 추구하며, 미래지향적인 비전을 제시하는 능력이 있습니다. 개성을 존중하고 다양성을 받아들이는 포용력이 있습니다.",
        "물고기자리": "남성으로서 물고기자리 태양은 높은 감성과 직관력을 가지고 있습니다. 예술적 감각이 뛰어나고 창의적인 표현력이 있으며, 타인에 대한 깊은 공감 능력을 보입니다. 영적이고 이상주의적인 측면이 강하며, 봉사와 희생정신이 있습니다."
      },
      "moon": {
        "양자리": "남성으로서 양자리 달은 감정적으로 직접적이고 솔직한 표현을 선호합니다. 이상적인 여성상으로 독립적이고 자신감 있으며, 도전정신이 강한 여성에게 끌릴 수 있습니다. 감정적 욕구가 즉각적으로 표현되며, 새로운 감정적 경험을 추구하는 경향이 있습니다.",
        "황소자리": "남성으로서 황소자리 달은 감정적 안정과 편안함을 중요시합니다. 이상적인 여성상으로 따뜻하고 양육적이며, 실용적이고 안정적인 여성에게 끌릴 수 있습니다. 감정 표현이 꾸준하고 지속적이며, 물질적 풍요로움을 통해 사랑을 표현하려 합니다.",
        "쌍둥이자리": "남성으로서 쌍둥이자리 달은 지적인 자극과 대화를 통해 감정적 만족을 얻습니다. 이상적인 여성상으로 똑똑하고 재치 있으며, 다양한 주제로 흥미로운 대화를 나눌 수 있는 여성에게 끌릴 수 있습니다. 감정을 언어로 표현하는 것을 선호합니다.",
        "게자리": "남성으로서 게자리 달은 가정적이고 보호적인 감정적 성향을 가집니다. 이상적인 여성상으로 모성적이고 따뜻하며, 가족을 소중히 여기는 여성에게 끌릴 수 있습니다. 감정적 유대감과 안정감을 중요시하며, 전통적인 가족 가치를 추구합니다.",
        "사자자리": "남성으로서 사자자리 달은 인정과 찬사를 통해 감정적 만족을 얻습니다. 이상적인 여성상으로 창의적이고 자신감 있으며, 열정적이고 활기찬 여성에게 끌릴 수 있습니다. 로맨틱하고 드라마틱한 사랑을 추구하며, 관대하고 충성스러운 사랑을 표현합니다.",
        "처녀자리": "남성으로서 처녀자리 달은 실용적이고 체계적인 방식으로 감정을 처리합니다. 이상적인 여성상으로 지적이고 체계적이며, 자기관리가 잘 되어 있는 여성에게 끌릴 수 있습니다. 서비스와 도움을 통해 사랑을 표현하며, 완벽주의적 성향을 보입니다.",
        "천칭자리": "남성으로서 천칭자리 달은 조화롭고 균형 잡힌 관계를 추구합니다. 이상적인 여성상으로 우아하고 사교적이며, 미적 감각이 뛰어난 여성에게 끌릴 수 있습니다. 파트너십을 중요시하며, 공정하고 평등한 관계를 원합니다.",
        "전갈자리": "남성으로서 전갈자리 달은 깊고 강렬한 감정적 연결을 추구합니다. 이상적인 여성상으로 신비롭고 깊이 있으며, 감정적으로 강한 여성에게 끌릴 수 있습니다. 진정한 신뢰와 깊은 유대감을 중요시하며, 전적인 헌신을 보입니다.",
        "궁수자리": "남성으로서 궁수자리 달은 자유롭고 모험적인 감정 표현을 선호합니다. 이상적인 여성상으로 독립적이고 지적이며, 모험정신이 있는 여성에게 끌릴 수 있습니다. 철학적이고 영적인 연결을 중요시하며, 성장과 확장을 함께 추구합니다.",
        "염소자리": "남성으로서 염소자리 달은 안정적이고 책임감 있는 감정 표현을 합니다. 이상적인 여성상으로 야심 있고 자기 훈련이 되어 있으며, 책임감 있는 여성에게 끌릴 수 있습니다. 장기적이고 실용적인 관계를 추구하며, 목표 달성을 함께 지원합니다.",
        "물병자리": "남성으로서 물병자리 달은 독립적이고 객관적인 감정 처리를 합니다. 이상적인 여성상으로 독창적이고 지적이며, 사회적 의식이 강한 여성에게 끌릴 수 있습니다. 우정 기반의 관계를 중요시하며, 개인의 자유와 독립성을 존중합니다.",
        "물고기자리": "남성으로서 물고기자리 달은 직관적이고 공감적인 감정 표현을 합니다. 이상적인 여성상으로 부드럽고 이해심 많으며, 예술적 감각이 있는 여성에게 끌릴 수 있습니다. 로맨틱하고 이상적인 사랑을 추구하며, 깊은 영적 연결을 중요시합니다."
      }
    },
    "female": {
      "sun": {
        "양자리": "여성으로서 양자리 태양은 독립적이고 진취적인 에너지를 가지고 있습니다. 이상적인 남성상으로 활동적이고 용감하며, 결단력 있는 파트너에게 끌릴 수 있습니다. 직업적, 사회적 표현에서 리더십과 개척정신을 보여주며, 주도적인 역할을 자연스럽게 맡습니다.",
        "황소자리": "여성으로서 황소자리 태양은 안정성과 실용성을 중요시합니다. 이상적인 남성상으로 신뢰할 수 있고 책임감 있으며, 물질적 안정을 제공할 수 있는 파트너에게 끌릴 수 있습니다. 미적 감각이 뛰어나고 품질을 중시하는 라이프스타일을 추구합니다.",
        "쌍둥이자리": "여성으로서 쌍둥이자리 태양은 지적이고 다재다능한 특성을 가지고 있습니다. 이상적인 남성상으로 지적이고 재치 있으며, 다양한 주제로 흥미로운 대화를 나눌 수 있는 파트너에게 끌릴 수 있습니다. 소통과 학습을 통해 자아를 표현하며, 유연하고 적응력 있는 모습을 보입니다.",
        "게자리": "여성으로서 게자리 태양은 양육적이고 보호적인 에너지를 자연스럽게 표현합니다. 이상적인 남성상으로 감성적이고 가정적이며, 보호적인 파트너에게 끌릴 수 있습니다. 직업적으로도 돌봄과 양육의 요소가 있는 역할에서 만족감을 느끼며, 직관적이고 공감적인 리더십을 발휘합니다.",
        "사자자리": "여성으로서 사자자리 태양은 자신감 있고 창의적인 에너지를 발산합니다. 이상적인 남성상으로 자신감 있고 관대하며, 창의적이고 열정적인 파트너에게 끌릴 수 있습니다. 무대에서 빛나는 것을 좋아하며, 자신만의 독특한 스타일과 매력으로 주목받는 것을 즐깁니다.",
        "처녀자리": "여성으로서 처녀자리 태양은 세심하고 완벽주의적인 접근을 보입니다. 이상적인 남성상으로 신중하고 책임감 있으며, 지적이고 분석적인 파트너에게 끌릴 수 있습니다. 봉사정신과 실용적인 문제해결 능력으로 조직이나 공동체에 기여하는 역할을 선호합니다.",
        "천칭자리": "여성으로서 천칭자리 태양은 조화와 균형을 추구하는 우아함을 가지고 있습니다. 이상적인 남성상으로 세련되고 공정하며, 미적 감각이 뛰어난 파트너에게 끌릴 수 있습니다. 외교적이고 사교적인 능력으로 다양한 관계에서 중재자 역할을 잘 수행합니다.",
        "전갈자리": "여성으로서 전갈자리 태양은 깊이 있고 강렬한 에너지를 가지고 있습니다. 이상적인 남성상으로 깊이 있고 열정적이며, 진실한 파트너에게 끌릴 수 있습니다. 변화와 변환을 이끌어내는 능력이 있으며, 위기 상황에서 강한 리더십을 발휘합니다.",
        "궁수자리": "여성으로서 궁수자리 태양은 자유롭고 모험적인 정신을 가지고 있습니다. 이상적인 남성상으로 지적이고 모험적이며, 철학적 사고를 가진 파트너에게 끌릴 수 있습니다. 학습과 여행을 통해 시야를 넓히며, 진리와 의미를 추구하는 삶을 살아갑니다.",
        "염소자리": "여성으로서 염소자리 태양은 목표지향적이고 야심적인 에너지를 가지고 있습니다. 이상적인 남성상으로 성취욕이 있고 안정적이며, 사회적 지위가 있는 파트너에게 끌릴 수 있습니다. 전문성과 책임감으로 사회적 성취를 이루어내며, 장기적인 비전을 실현합니다.",
        "물병자리": "여성으로서 물병자리 태양은 독립적이고 혁신적인 사고를 가지고 있습니다. 이상적인 남성상으로 지적이고 독창적이며, 인도주의적인 파트너에게 끌릴 수 있습니다. 사회적 변화를 이끌어내는 역할을 하며, 개성과 다양성을 존중하는 가치관을 가지고 있습니다.",
        "물고기자리": "여성으로서 물고기자리 태양은 직관적이고 공감적인 에너지를 가지고 있습니다. 이상적인 남성상으로 감성적이고 영적이며, 예술적 감각이 있는 파트너에게 끌릴 수 있습니다. 창의적이고 치유적인 역할을 통해 타인에게 영감을 주며, 봉사와 희생정신을 발휘합니다."
      },
      "moon": {
        "양자리": "여성으로서 양자리 달은 감정적으로 독립적이고 직접적인 표현을 선호합니다. 감정적 욕구가 즉각적이고 솔직하게 표현되며, 새로운 감정적 경험에 대한 용기가 있습니다. 감정적 도전을 통해 성장하며, 자신의 감정에 대해 주도권을 가지려 합니다.",
        "황소자리": "여성으로서 황소자리 달은 감정적 안정과 편안함을 추구합니다. 감각적인 즐거움과 아름다움을 통해 감정적 만족을 얻으며, 지속적이고 안정적인 감정 표현을 선호합니다. 실용적이고 현실적인 방식으로 사랑을 표현하고 받습니다.",
        "쌍둥이자리": "여성으로서 쌍둥이자리 달은 지적인 자극을 통해 감정적 만족을 얻습니다. 대화와 소통을 통해 감정을 처리하며, 다양한 감정적 경험에 대한 호기심이 있습니다. 감정을 언어로 표현하는 능력이 뛰어나고, 변화하는 감정 상태를 자연스럽게 받아들입니다.",
        "게자리": "여성으로서 게자리 달은 깊은 모성애와 양육 본능을 가지고 있습니다. 가족과 가정에 대한 강한 애착을 보이며, 타인을 돌보고 보호하는 것에서 감정적 만족을 얻습니다. 직관적이고 공감적인 능력이 뛰어나며, 전통적인 여성성을 자연스럽게 표현합니다.",
        "사자자리": "여성으로서 사자자리 달은 감정적으로 표현력이 풍부하고 드라마틱합니다. 창의적인 자기표현을 통해 감정적 만족을 얻으며, 인정과 칭찬에 대한 욕구가 강합니다. 따뜻하고 관대한 마음으로 사랑하며, 로맨틱하고 열정적인 관계를 추구합니다.",
        "처녀자리": "여성으로서 처녀자리 달은 감정을 실용적이고 체계적으로 처리합니다. 자기개선과 완벽함을 추구하며, 서비스와 도움을 통해 사랑을 표현합니다. 건강과 웰빙에 관심이 많고, 세심한 배려를 통해 감정적 유대감을 형성합니다.",
        "천칭자리": "여성으로서 천칭자리 달은 조화롭고 균형 잡힌 감정 표현을 선호합니다. 미적 감각이 뛰어나고 아름다움을 통해 감정적 만족을 얻으며, 파트너십과 관계를 매우 중요시합니다. 공정하고 평등한 관계를 추구하며, 갈등보다는 조화를 선호합니다.",
        "전갈자리": "여성으로서 전갈자리 달은 깊고 강렬한 감정 세계를 가지고 있습니다. 진정한 친밀감과 깊은 유대감을 추구하며, 감정적 변화와 재생 능력이 뛰어납니다. 직관력이 매우 강하고, 타인의 숨겨진 감정을 잘 파악하는 능력이 있습니다.",
        "궁수자리": "여성으로서 궁수자리 달은 자유롭고 낙관적인 감정 표현을 합니다. 모험과 새로운 경험을 통해 감정적 성장을 추구하며, 철학적이고 영적인 연결을 중요시합니다. 솔직하고 직설적인 감정 표현을 선호하며, 감정적 독립성을 유지하려 합니다.",
        "염소자리": "여성으로서 염소자리 달은 감정적으로 절제되고 실용적인 접근을 합니다. 안정과 보안을 통해 감정적 만족을 얻으며, 장기적이고 책임감 있는 관계를 추구합니다. 성취와 인정을 통해 감정적 자신감을 얻으며, 전통적인 가치를 중요시합니다.",
        "물병자리": "여성으로서 물병자리 달은 독립적이고 객관적인 감정 처리를 합니다. 개인의 자유와 독창성을 중요시하며, 사회적 의식과 인도주의적 가치를 통해 감정적 만족을 얻습니다. 우정 기반의 관계를 선호하며, 감정적 거리두기를 통해 객관성을 유지합니다.",
        "물고기자리": "여성으로서 물고기자리 달은 직관적이고 공감적인 감정 세계를 가지고 있습니다. 예술적이고 창의적인 표현을 통해 감정을 드러내며, 영적이고 초월적인 경험에 끌립니다. 타인의 감정을 쉽게 흡수하고 공감하는 능력이 있으며, 치유와 봉사를 통해 감정적 만족을 얻습니다."
      }
    }
  }
}