{
  "basic_interpretations": {
    "sun": {
      "Aries": "Aries Sun represents a passionate and active personality. You possess courage and confident energy, and you're not afraid of challenges. You have an independent and autonomous nature, preferring to forge your own path. Your expression style is direct and honest, with a tendency to speak your mind immediately. You have a pioneering spirit and don't hesitate to try new things.",
      "Taurus": "Taurus Sun represents a stable and practical personality. You have excellent endurance and patience, with a tendency to see things through to completion once started. You value material stability and comfort, and have excellent aesthetic sense. You prefer stability over change, and are careful and reliable. You value tradition and seek practical results.",
      "Gemini": "Gemini Sun represents an intellectual personality with excellent adaptability. You have outstanding communication skills and expressiveness, showing interest in various topics. You have strong curiosity and constantly pursue new knowledge and experiences. You have quick comprehension and adaptability, handling changing environments well. You're versatile and capable of multitasking effectively.",
      "Cancer": "Cancer Sun represents an emotional and protective personality. You have deep sensitivity and intuition, being sensitive to others' emotions. You value family and home, with strong instincts to protect and care for loved ones. You seek safety and stability, feeling comfortable in familiar environments and relationships. You have good memory and value connections to the past, potentially interested in tradition and history.",
      "Leo": "Leo Sun represents a charismatic and creative personality. You're confident and express your presence boldly. You have excellent creative and artistic talents and expressiveness. You're generous and warm-hearted with strong loyalty. You have leadership qualities and enjoy being the center of attention. You're passionate, energetic, and radiate positive energy.",
      "Virgo": "Virgo Sun represents a practical and perfectionist personality. You're detail-oriented and analytical, paying attention to specifics. You prefer systematic and organized approaches, pursuing efficiency. You have a strong service spirit and enjoy helping others. You excel at finding practical solutions and are interested in health and wellness.",
      "Libra": "Libra Sun represents a personality that seeks balance and harmony. You value fairness and balance, considering all perspectives. You're sociable and skilled in relationships, enjoying cooperation. You have excellent aesthetic sense and pursue beauty and harmony. You avoid conflict and strive to find peaceful solutions. You excel at listening to various opinions and mediating.",
      "Scorpio": "Scorpio Sun represents an intense and profound personality. You have deep insight and intuition, pursuing essence rather than surface appearances. You have strong willpower and determination, persistently working toward goals. You have strong curiosity about secrets and mysteries, with excellent ability to discover hidden truths. Your emotions are deep and passionate, and once you form relationships, you're very loyal and devoted.",
      "Sagittarius": "Sagittarius Sun represents a free and adventurous personality. You have optimistic and passionate energy, seeking new experiences. You have philosophical tendencies and pursue wisdom, seeking greater meaning and truth. You prefer direct and honest expression, valuing free thinking. You enjoy expanding your horizons through travel and learning.",
      "Capricorn": "Capricorn Sun represents a responsible and ambitious personality. You're goal-oriented with excellent ability to create and execute long-term plans. You have strong patience and perseverance, not giving up even in difficult situations. You value tradition and order, striving to build stable foundations. You value achievement and recognition, pursuing social status and success.",
      "Aquarius": "Aquarius Sun represents an independent and innovative personality. You have original and creative thinking, pursuing new ideas and perspectives. You have strong social consciousness and care about the greater community and humanity's welfare. You have a free spirit unbound by conventions, capable of challenging existing rules and traditions. You value individual uniqueness and pursue diversity and equality.",
      "Pisces": "Pisces Sun represents an intuitive and emotional personality. You're highly intuitive with excellent empathetic abilities. You have artistic sense and rich imagination. You easily sense and understand others' emotions. You're drawn to spiritual or mystical topics. You have idealistic and romantic tendencies, and sometimes the boundary between reality and fantasy can be blurred."
    },
    "moon": {
      "Aries": "Aries Moon represents direct and honest emotional expression. You're emotionally independent and autonomous, preferring immediate emotional expression. You have strong inner will and determination, actively responding to emotional challenges. You're open to new emotional experiences, seeking inner growth through adventure. Your emotions arise and are expressed quickly but tend not to last long.",
      "Taurus": "Taurus Moon emotionally values stability and security. You seek comfort and material safety, valuing sensual pleasure and beauty. You prefer stability over change, finding emotional stability in trustworthy relationships and environments. You express emotions slowly, but once feelings develop, they're deep and lasting. You have strong inner patience and determination, steadily pursuing decisions once made.",
      "Gemini": "Gemini Moon tends to analyze and express emotions intellectually. You seek various emotional experiences and process emotions through communication. You're curious and desire new emotional stimulation, naturally accepting changing emotional states. You prefer expressing emotions verbally, gaining emotional satisfaction through intellectual exchange. Sometimes you may pursue variety over emotional depth.",
      "Cancer": "Cancer Moon is emotionally very sensitive and intuitive. You have strong attachment to family and home, finding emotional stability in familiar environments. You easily empathize with others' emotions, with strong protective and nurturing instincts. Past memories and experiences greatly influence current emotions, and you value tradition and family values. Your emotions change greatly and can fluctuate like lunar cycles.",
      "Leo": "Leo Moon is emotionally warm and passionate. You have a strong inner desire to be recognized and respected. You tend to gain emotional satisfaction through creative self-expression and achievement. You're very generous and protective toward loved ones, with strong loyalty. Sometimes you can be emotionally dramatic, and if your pride is hurt, you may react strongly. Your emotional expression is rich and vibrant.",
      "Virgo": "Virgo Moon tends to process emotions analytically. You pursue inner order and structure, finding emotional stability through practical means. You pay attention to details and pursue perfection. You have inner desires for self-improvement and growth, with great interest in health and wellness. Sometimes you can be self-critical and worry too much, approaching emotions too analytically.",
      "Libra": "Libra Moon emotionally seeks balance and harmony. You find emotional stability in relationships, gaining inner satisfaction through partnership and cooperation. You have excellent aesthetic sense and react emotionally to beauty. You value fairness and justice, with inner desires to consider all perspectives. Sometimes you have difficulty making decisions, striving to find emotional balance.",
      "Scorpio": "Scorpio Moon has deep and intense emotions. You seek deeper emotional connections rather than surface-level ones, with strong inner intuition and insight that helps you perceive others' hidden emotions well. You don't reveal emotions easily, showing your inner self only to trustworthy people. You can experience extreme emotions, with great emotional depth and intensity. You have inner understanding of change and regeneration.",
      "Sagittarius": "Sagittarius Moon internally craves freedom and adventure. You gain emotional satisfaction through broad perspectives and new experiences. You have optimistic and passionate emotional expression, expressing emotions in honest and direct ways. You have inner journeys pursuing philosophical wisdom and greater truth. You value emotional freedom and dislike being constrained. You have rich humor and inner childlike passion and curiosity.",
      "Capricorn": "Capricorn Moon is emotionally restrained with strong self-control. You value inner responsibility and duty, tending to prioritize practicality over emotions. You seek achievement and security for emotional stability, steadily working toward goals. You have inner ambition and take practical approaches to your emotions. You have strong emotional resilience in difficult situations, managing emotions through self-discipline and patience.",
      "Aquarius": "Aquarius Moon is emotionally independent and objective. You value greater ideals and humanitarian values over personal emotions. You tend to analyze emotions intellectually, expressing emotions in unique and creative ways. You prefer free emotional expression, not bound by conventional emotional patterns. Sometimes you tend to maintain emotional distance, finding emotional satisfaction in collective consciousness and social solidarity.",
      "Pisces": "Pisces Moon is emotionally very intuitive with excellent empathetic abilities. You have rich inner imagination and artistic sense. You tend to easily absorb and understand others' emotions. Your boundaries are flexible, sometimes making it difficult to distinguish between your own and others' emotions. You have idealistic and romantic inner worlds, potentially interested in spiritual topics. Your emotions are changeable with deep sensitivity."
    },
    "ascendant": {
      "Aries": "Aries Ascendant gives an active and proactive first impression. You tend to approach people with confident and energetic appearance. You face the world with direct and honest attitudes, showing that you're not afraid of challenges. You appear to have leadership qualities and seem to enjoy new beginnings. Your quick decision-making and action-oriented nature are externally visible, with an independent personality that's felt by others.",
      "Taurus": "Taurus Ascendant gives a calm and stable first impression. You project a trustworthy and reliable image, showing practical and realistic approaches. You appear patient and seem like someone who makes steady and consistent efforts. You appear to have excellent aesthetic sense, showing that you value quality and worth. Your pursuit of comfort and stability is externally visible.",
      "Gemini": "Gemini Ascendant appears intellectual and curious, radiating lively and bright energy. You appear to have excellent communication skills, showing ability to lead conversations on various topics. You tend to approach people with high adaptability and flexible attitudes. Your quick thinking and witty speech show intellectual charm in first impressions. You appear versatile and capable of handling multiple tasks simultaneously.",
      "Cancer": "Cancer Ascendant gives a warm and friendly first impression. You radiate protective and nurturing energy, appearing to have the ability to make others comfortable. You appear emotionally sensitive with excellent empathetic abilities, showing that you value family-like and intimate relationships. You appear to have intuitive and emotional approaches, with attitudes that seem to cherish tradition and the past.",
      "Leo": "Leo Ascendant gives a confident and charismatic first impression. You have a strong presence, tending to approach people with warm and passionate energy. You're creative and expressive, revealing your unique style and distinctiveness. You appear to have leadership qualities and often naturally become the center of situations. You inspire those around you with generous and positive attitudes.",
      "Virgo": "Virgo Ascendant gives a calm, analytical, and organized image. You approach people with careful and prudent attitudes, showing practical approaches. Your intellectual and logical aspects are externally visible, appearing to have excellent problem-solving abilities. You project trustworthiness through modest and accuracy-seeking appearances. Your perfectionist tendencies are expressed externally through attention to detail.",
      "Libra": "Libra Ascendant gives an elegant and balanced first impression. You project attractive and refined images, tending to approach people with diplomatic and harmony-seeking attitudes. You value fairness and balance, showing preferences for cooperation over conflict. You appear to have excellent artistic sense and refined taste. You demonstrate smooth communication skills in social relationships.",
      "Scorpio": "Scorpio Ascendant gives an intense and mysterious first impression. You appear deep and insightful, showing that you pursue essence rather than surface appearances. You have charisma and self-assurance, appearing to be good at perceiving others' motivations and hidden aspects. You appear to have deep understanding of change and transformation, revealing strong aspects in crisis situations. You appear to have secretive and selective communication styles.",
      "Sagittarius": "Sagittarius Ascendant gives a free and optimistic first impression. You radiate adventurous and passionate energy, approaching people with open and honest attitudes. You appear philosophical and wise, showing that you pursue greater meaning and truth. You appear to enjoy travel and new experiences, perceived as having international and multicultural interests. You have humor and convey positive energy.",
      "Capricorn": "Capricorn Ascendant gives a serious and responsible first impression. You project trustworthy and stable images, showing goal-oriented and ambitious aspects. You approach people with professional and mature attitudes, appearing to value long-term planning and consistent effort. You appear to respect tradition and order, with attitudes that seem to value social status and achievement.",
      "Aquarius": "Aquarius Ascendant gives a unique and individualistic first impression. You appear to have independent and free-spirited nature, perceived as someone with innovative and creative ideas. You appear humanitarian with strong social consciousness, showing that you value diversity and equality. You appear to have free approaches unbound by conventions, perceived as having future-oriented thinking.",
      "Pisces": "Pisces Ascendant gives a soft and dreamy first impression. You radiate warm and kind energy, with strongly felt empathetic abilities. You react sensitively to others' emotions, with creative and artistic qualities externally visible. You have flexible boundaries and high adaptability, easily adapting to various environments and people. You project mysterious and intuitive images, potentially showing spiritual or artistic interests."
    }
  },
  "gender_specific": {
    "male": {
      "Aries": "As a male with Aries Moon, you prefer emotionally direct and honest expression. Your ideal feminine type may be attracted to independent, confident women with strong challenging spirit. Your emotional needs are expressed immediately, with tendencies to seek new emotional experiences.",
      "Taurus": "As a male with Aries Moon, you prefer emotionally direct and honest expression. Your ideal feminine type may be attracted to independent, confident women with strong challenging spirit. Your emotional needs are expressed immediately, with tendencies to seek new emotional experiences.",
      "Gemini": "As a male with Gemini Moon, you gain emotional satisfaction through intellectual stimulation and conversation. Your ideal feminine type may be attracted to intelligent, witty women who can have interesting conversations on various topics. You prefer expressing emotions through language.",
      "Cancer": "As a male with Cancer Moon, you have domestic and protective emotional tendencies. Your ideal feminine type may be attracted to maternal, warm women who value family. You value emotional bonds and stability, pursuing traditional family values.",
      "Leo": "As a male with Leo Moon, you gain emotional satisfaction through recognition and praise. Your ideal feminine type may be attracted to creative, confident, passionate, and vibrant women. You pursue romantic and dramatic love, expressing generous and loyal love.",
      "Virgo": "As a male with Virgo Moon, you process emotions in practical and systematic ways. Your ideal feminine type may be attracted to intellectual, systematic women who are well self-managed. You express love through service and help, showing perfectionist tendencies.",
      "Libra": "As a male with Libra Moon, you pursue harmonious and balanced relationships. Your ideal feminine type may be attracted to elegant, sociable women with excellent aesthetic sense. You value partnership and desire fair and equal relationships.",
      "Scorpio": "As a male with Scorpio Moon, you seek deep and intense emotional connections. Your ideal feminine type may be attracted to mysterious, deep, emotionally strong women. You value genuine trust and deep bonds, showing complete devotion.",
      "Sagittarius": "As a male with Sagittarius Moon, you prefer free and adventurous emotional expression. Your ideal feminine type may be attracted to independent, intellectual, adventurous women. You value philosophical and spiritual connections, pursuing growth and expansion together.",
      "Capricorn": "As a male with Capricorn Moon, you express emotions in stable and responsible ways. Your ideal feminine type may be attracted to ambitious, self-disciplined, responsible women. You pursue long-term and practical relationships, supporting goal achievement together.",
      "Aquarius": "As a male with Aquarius Moon, you process emotions independently and objectively. Your ideal feminine type may be attracted to original, intellectual women with strong social consciousness. You value friendship-based relationships and respect individual freedom and independence.",
      "Pisces": "As a male with Pisces Moon, you express emotions intuitively and empathetically. Your ideal feminine type may be attracted to gentle, understanding women with artistic sense. You pursue romantic and idealistic love, valuing deep spiritual connections."
    },
    "female": {
      "Aries": "As a female with Aries Moon, you prefer emotionally independent and direct expression. Your emotional needs are expressed immediately and honestly, with courage for new emotional experiences. You grow through emotional challenges and try to have control over your emotions.",
      "Taurus": "As a female with Taurus Moon, you pursue emotional stability and comfort. You gain emotional satisfaction through sensual pleasure and beauty, preferring continuous and stable emotional expression. You express and receive love in practical and realistic ways.",
      "Gemini": "As a female with Gemini Moon, you gain emotional satisfaction through intellectual stimulation. You process emotions through conversation and communication, with curiosity about various emotional experiences. You have excellent ability to express emotions through language and naturally accept changing emotional states.",
      "Cancer": "As a female with Cancer Moon, you have deep maternal love and nurturing instincts. You show strong attachment to family and home, gaining emotional satisfaction from caring for and protecting others. You have excellent intuitive and empathetic abilities, naturally expressing traditional femininity.",
      "Leo": "As a female with Leo Moon, you're emotionally expressive and dramatic. You gain emotional satisfaction through creative self-expression, with strong desires for recognition and praise. You love with warm and generous hearts, pursuing romantic and passionate relationships.",
      "Virgo": "As a female with Virgo Moon, you process emotions practically and systematically. You pursue self-improvement and perfection, expressing love through service and help. You're interested in health and wellness, forming emotional bonds through careful consideration.",
      "Libra": "As a female with Libra Moon, you prefer harmonious and balanced emotional expression. You have excellent aesthetic sense and gain emotional satisfaction through beauty, greatly valuing partnership and relationships. You pursue fair and equal relationships, preferring harmony over conflict.",
      "Scorpio": "As a female with Scorpio Moon, you have deep and intense emotional worlds. You pursue genuine intimacy and deep bonds, with excellent abilities for emotional change and regeneration. You have very strong intuition and ability to perceive others' hidden emotions well.",
      "Sagittarius": "As a female with Sagittarius Moon, you express emotions freely and optimistically. You pursue emotional growth through adventure and new experiences, valuing philosophical and spiritual connections. You prefer honest and direct emotional expression and try to maintain emotional independence.",
      "Capricorn": "As a female with Capricorn Moon, you approach emotions in restrained and practical ways. You gain emotional satisfaction through stability and security, pursuing long-term and responsible relationships. You gain emotional confidence through achievement and recognition, valuing traditional values.",
      "Aquarius": "As a female with Aquarius Moon, you process emotions independently and objectively. You value individual freedom and originality, gaining emotional satisfaction through social consciousness and humanitarian values. You prefer friendship-based relationships and maintain objectivity through emotional distancing.",
      "Pisces": "As a female with Pisces Moon, you have intuitive and empathetic emotional worlds. You express emotions through artistic and creative means, drawn to spiritual and transcendent experiences. You have abilities to easily absorb and empathize with others' emotions, gaining emotional satisfaction through healing and service."
    }
  }
}